backend/app/services/salary_insights_service.rb

  def self.by_country(country)
    employees = Employee.where(country: country)

    {
      min: employees.minimum(:salary)&.to_f,
      max: employees.maximum(:salary)&.to_f,
      avg: employees.average(:salary)&.to_f || 0.0
---
SELECT MIN("employees"."salary") FROM "employees" WHERE "employees"."country" = ''

  def self.by_job_title(country, job_title)
    Employee.where(country: country, job_title: job_title)
            .average(:salary)&.to_f || 0.0
---
SELECT AVG("employees"."salary") FROM "employees" WHERE "employees"."country" = 'India' AND "employees"."job_title" = 'Engineer'