backend/app/controllers/api/v1/employees_controller.rb

SELECT COUNT(*) FROM "employees" WHERE (LOWER(full_name) LIKE '%john%') AND "employees"."country" = 'UK'
SELECT "employees".* FROM "employees" ORDER BY "employees"."full_name" ASC
SELECT COUNT(*) FROM "employees"
SELECT "employees".* FROM "employees" ORDER BY "employees"."full_name" ASC LIMIT 10 OFFSET 0
---
      def index
        employees = Employee.all

        employees = employees.where(country: params[:country]) if params[:country].present?
        employees = employees.where(job_title: params[:job_title]) if params[:job_title].present?

        employees = employees.order(:full_name)

        page = (params[:page] || 1).to_i
        per_page = (params[:per_page] || 10).to_i

        paginated = employees.page(page).per(per_page)

INSERT INTO "employees" ("full_name", "job_title", "country", "salary", "department", "email", "hire_date", "employment_type", "created_at", "updated_at") VALUES ('John Deo', 'Enginner', 'US', 12344.0, 'HR', 'johndeo@gmail.com', '2026-01-01', 'Full-time', '2026-04-25 13:06:55.312255', '2026-04-25 13:06:55.312255') RETURNING "id"
---
      def create
        employee = Employee.new(employee_params)

        if employee.save

UPDATE "employees" SET "hire_date" = '2023-11-17', "updated_at" = '2026-04-25 13:11:52.533877' WHERE "employees"."id" = 6978
---
      def update
        if @employee.update(employee_params)